{
  "metadata": {
    "processedAt": "2026-01-17T16:33:13.544Z",
    "language": "en",
    "extractionMethod": "pdf-parse",
    "imageFormat": "png",
    "imageDPI": 300
  },
  "pages": [
    {
      "pageNum": 1,
      "image": "/oxi-e16-quick-start/pages/page-001.png",
      "title": "Page 1",
      "sectionName": null,
      "content": "Power On / Off\nHardware Overview\nPower is supplied through the USB-C connection. Connect to a USB power supply, computer or power bank. It is recommended to use a\nsupply greater that 200mA. The multifunctional button embedded in the OXI ‘O’ is used for turning the device on and off. This is called the\nshift button. To turn off, navigate to the main, top level menu. Tap the shift button to navigate backup in the structure of E16.\nThe E16 is supplied with this quick start guide, USB-C to A cable, and a high quality travel case. The full manual is available for download\nfrom the OXI Instruments site at oxiinstruments.com. The firmware and settings can also be managed by connecting the E16 to the OXI App.\nThe E16 is a compact MIDI parameter controller which can communicate MIDI over TRS, USB or Bluetooth connections. There are 16\npush encoders immediately available on the panel which can be configured for control of a destination device’s MIDI CC, Control Change,\nPC, note and other MIDI parameters. The controls are organised in Scenes. A scene contains 12 pages, each page with 16 parameter\ncontrols. Each parameter can have up to 2 controlled destinations and 1 push action. Parameter values at any given time can be stored\nas a preset and recalled later. So a scene can hold 192 parameters, 384 destinations. Navigation is performed using the 16 push /\nencoder knobs and the shift button.\nAdvanced MIDI Parameter Controller\nShift Button\nControl Knobs\tMultifunctional button.\nOperates\n- Back navigation.\n- Contextual menu.\n- Quick access combos. Operates\n- Direct Control.\n- Navigation select.\n16 Push / Turn.\nendless encoders.\nImportant: Encoder Type.\nThe encoder type setting found in\nthe system config must be set to\nmatch your hardware encoders in\norder for the software to manage\nthis behavior. The options are\nnormal, non-detented and detented.\nMIDI TRS Type A.\nRear / Edge\nMIDI\nDestination Synth,\nEffect or DAW.\nFront Panel\nUSB-C\nPower On Power Off\n1x In, 2x Out.\n+\nPower & MIDI.\nPower on/off using shift.\nHold the shift button Hold the shift button + hold the red lit encoder.\nout 1 \tout 2 \tin\n\n-- 1 of 1 --",
      "hasContent": true,
      "tags": []
    },
    {
      "pageNum": 2,
      "image": "/oxi-e16-quick-start/pages/page-002.png",
      "title": "Page 2",
      "sectionName": null,
      "content": "Navigating E16\nConventions\nScene Organisation\nThe main ‘home’ screen location in the structure of OXI E16 is presented when first powering on. This display will show the 7 available\nscenes labelled S.1 to S.7. The encoder knobs will perform selection of each scene. Any knob which is controlling a menu command will be\nlit. Tap a knob to select the option and tap shift to backup in the menu structure. In the home screen, knob 8 selects the system options.\nA scene is used to help structure and organise the controls which can then be saved in E16 memory. To start, select a scene to work with or\nto setup. You can open one of 7 scenes directly from the main, home menu. The home page scenes can be reorganised or one of the full\nset of 16 scenes can be selected by holding [Shift] and clicking any scene button. Within the shift menu the selected parameter page can\nalso be changed.\nSystem menu and\nglobal settings.\nUp to 7 Scenes are\ndirectly accessible.\nChoose a Scene.\nTap to select a scene from\nthe home screen or hold\nshift + tap for other scenes.\nHome / Scenes Control View Shift Menu / Page Selection\nSave Yes\tSave No\nThis is the main, home screen and is\navailable upon power up.\nIf any scene parameters have been\nedited, backing up to the home screen\nwill prompt to save the scene.\nView or Change Controls\nHold [Shift] to select a page\nor to access the controls\nmenu options.\n+\nTurn a knob to adjust the\nMIDI output value for the\nrespective parameter. REC - Record. Records parameter\nautomation. Will capture the control value\nchanges while turning a knob. Tap to stop.\nLock. Retains screen location to prevent\nbacking up to the main, home menu.\nEdit. Opens the edit menu for configuring\neach CC parameter.\nPrst - Preset. Opens the load and save\npreset management menu.\nPage or Menu Option\nTap a knob to change the page\ngroup or to choose an option.\nMenu Options: Knobs 13-16\nIn several screens, the knob position matches the position of\nthe displayed elements. For example the scenes presented\nfrom the home page match the 1-8 knob positions.\nAny knob which has a currently\nselectable menu option will be lit.\nThe [Shift] button is used as a classic shift, to access\nsecondary parameters or to backup or exit menus.\nThe rotary LEDs will indicate a\nparameter value setting.\nS. \t1\nS. \t5\nS. 3\nS. 7\nS. 2\nS. 6\nS. \t4\nCONF\nS. \t1\nS. \t5\nS. 3\nS. 7\nS. 2\nS. 6\nS. \t4\nCONF\nS. \t1-P. \t1\nCC1 \tCC2 \tCC3 \tCC4\nCC9 \tCC10 \tCC11 \tCC12\nCC5 \tCC6 \tCC7 \tCC8\nCC13 \tCC14 \tCC15 \tCC16\nS. \t1\nP.1 \tP.2 \tP.3 \tP.4\nP.9 \tP.10 \tP.11 \tP.12\nP.5 \tP.6 \tP.7 \tP.8\nREC \tLock \tEdit \tPrst\nS.4\nConf\nTurn\nEdit or change value of the\nthe respective parameter\nTap\nSelect the respective displayed\noption. Example to open a scene.\n[Shift] + Tap\nAccess secondary options\nand menu commands.\nTap [Shift]\nNavigate backup in the\nmenu hierarchy structure\nS.3\nS.7\nS.2\nS.6\nS.1\nS.1\nCC1\nS.5\nMain Menu: Scene & System Selection\n\n-- 1 of 1 --",
      "hasContent": true,
      "tags": []
    },
    {
      "pageNum": 3,
      "image": "/oxi-e16-quick-start/pages/page-003.png",
      "title": "Page 3",
      "sectionName": null,
      "content": "Scene Presets\nScenes can be saved to the E16 memory. Each scene contains 16 presets which stores the parameter values of all the knobs at a given\ntime. Presets can be individually named and can be recalled for later use.\nDifferent configurations are therefore possible in order to match various hardware setups. The preset option is located in shift menu,\naccessed from the control view by holding [Shift] and pressing Knob 16 (Prst). The preset management menu is then navigated using Knob\n1 which will be shown lit. A maximum of 16 preset slots are available.\nPage \tScene\nAbbr.\nCtrl 3\nCC3\nSpecial \tOff\nColor \t12\nParameter Setup\nThe workflow to navigate and setup each parameter in the scenes control view aims for quick and easy editing. The destination, behavior\nand name for each control can be edited.\nDirectly edit a control.\nIn the control view, hold a knob + tap [Shift]\nIt is also possible to open the control editor with [Shift] + Knob 15 for 'Edit' from the control view.\nKnobs represent each parameter control.\nThe default knob assignment is in a\nnumerical CC order. This can be changed.\nThe ‘Page’ and ‘Scene’ settings are also\naccessible in this menu. Hold [Shift] + Tap\nKnobs to switch tabs for the editor focus.\nTap a knob to select the control or page to\nedit from within these menus.\nThe control change options can be edited for\neach individual parameter. This sets how the\nparameter is displayed on the E16 and how it\naffects the destination.\nCC3\nParameter Options Turn knob to navigate, tap knob to change.\nFunction Description\nAbbr Label Abbreviation Allows editing of up to 4 characters. This is the label used on the control page for the\nparameter. Editing of the label is made using the first 4 knobs, instructions as displayed.\nColor LED ring color Assigns the color for the LED indicators. These are displayed around the specific control\nencoder knob to represent its value.\nSpecial Encoder Options\nCan be set to off. Bipolar will operate -63 to +64 as opposed to 0-127. Snapshot will\ncapture and store an A and B value to assign as the knob range. Rec will allow\nautomation to be recorded to the knob when in the control page. Press the knob in the\ncontrol page to start / stop recording.\nDest1 Destination 1 Sets the parameters associated with controlling the destination device. Two device\ndestinations can be assigned to each parameter. The options available are identical.\nOptions includes range, type, target, output port, channel, etc\tDest2 Destination 2\nPush Knob push behavior Sets the behavior of the push command on the encoder and its associated display.\nCopy Copy Settings Allows copying of these settings to be copied to another parameter.\nPaste Paste Settings Allows pasting of previously copied settings to this parameter.\nClear Clear settings Allows clearing of the settings to defaults.\nScene \tPages\nScene Editor\nPage\nControl\nCancel\nP.1 \tP.2 \tP.3 \tP.4\t\nP.5 \tP.6 \tP.7 \tP.8\t\nP.9 \tP.10 \tP.11 \tP.12\nSet \tSet as Next\nSave\nInstruments\nGB Glide\nVolume\nOSC \tTrns\nDLY Time\nName \tName\nAbbr\nName\nChannel\nCC\nOutput\nType\nColor\nScene \tP.1\nCC1\nCC1\nCCAb\t\nDestination\nTurn \tPush\n~Same\n~Same\n0\nALL\n1 \t+\n+\n-\n-\nMicromonsta\nBank SEL\nMOD WHL\t\nGB EQ OF\nIcon \tOutput\nChannel\t\nScene \t- \tP. 1\t\nCC1 \tCC2 \tCC3 \tCC4\t\nCC9 \tCC10 \tCC11 \tCC12\t\nCC5 \tCC6 \tCC7 \tCC8\t\nCC13 \tCC14 \tCC15 \tCC16\nWhile the setting up and configuration of the E16 s possible from the on-board controls, it is\neasier and quicker to create configurations using the OXI App and its integrated E16 Scene editor.\nDownload the App from the OXI site.\nOXI App\n+\n\n-- 1 of 1 --",
      "hasContent": true,
      "tags": []
    },
    {
      "pageNum": 4,
      "image": "/oxi-e16-quick-start/pages/page-004.png",
      "title": "Page 4",
      "sectionName": null,
      "content": "Groups\nEach of the individual parameters can also be added to a ‘group’. A group is a collection of 2 or more parameters that can be controlled\ntogether as a collective set. Push and hold an encoder knob to view the group status. A maximum of 4 groups are available.\nGet the full manual here\noxiinstruments.com/support\nTag us on social media:\n@oxiinstruments, #oxione #oxiinstruments\nSet groups In the control view.\nTap the knobs to add to the group while holding the first knob. Each tap cycles through the behavior mode for the parameter.\nExample: Add knob encoder 2 and 3 to Group 1 controlled by knob 1.\nParameters displayed with a ‘dotted’ bounding box will act as a primary lead control. If any of these are adjusted, the values of the\nother parameters in the same group are also adjusted in harmony. The value change is relative to each of the parameter’s original\nvalue. In the example below, all three knobs will affect the value of itself and the other two parameters.\nParameters displayed with a ‘solid’ bounding box will follow any changes made by a primary lead control, but can also be adjusted\nindependently. The primary lead controls are shown with a ‘dotted’ boundary box. In the example above only CC1, when adjusted,\nwill affect its own value plus the value of the other 2 parameters. When changing the CC2 or CC3 knob, only its own individual value\nis changed. Other parameters in the group are not affected.\nThe amount of control applied by the primary lead to a follower can be set for each follower parameter. The amount is set on each\nfollower by holding & turning its knob. In this example hold + turn knob 2 (CC2) to set the amount and repeat for CC3.\nCC4\tCC3\tCC2\tCC1\nGroup \t1\nCC1 \tCC2 \tCC3 \tCC4\nCC9 \tCC10 \tCC11 \tCC12\nCC5 \tCC6 \tCC7 \tCC8\nCC13 \tCC14 \tCC15 \tCC16\nHold Knob + Tap knob a second time. Group 1\nGroup 1\nLead\nLead & Follow\nFollower\nLead & Follow\nFollower Follower Amount\npush & turn\nLead & Follow\nHold Knob + Tap the knob first time\nOperating Behavior\nCC1\nCC1\nCC2\nCC2\nCC3\nCC3 55%\nStart. Hold [Shift] + Tap Knob 13 'REC' in the\ncontrol view, then adjust a parameter knob\nwhile recording.\nStop. Click the automated encoder knob to\nstop the recording for that particular control.\nDelete. While automation plays in the control view, turn an encoder to cancel and delete its individual recording.\nTo stop and clear all recordings, Hold [Shift] and Keep Hold of Knob 13 - 'Rec/Stop'.\nStop. Hold [Shift] + Tap Knob 13 'STOP' again\nto stop recording and commence playback.\nRecord\nStop Rec / Play\nRecording\nRecording\nRelease [Shift] and\nTurn the knob\n0\n127\nTurn Parameter\n+\n+\nRecording Automation\nRecording start/stop can be controlled from the control view by holding [Shift] and tapping Knob 13, then turning a control knob will record\nthe parameter changes. Other knobs can be setup to control recording and playback. These are configured in the special settings.\n\n-- 1 of 1 --",
      "hasContent": true,
      "tags": []
    }
  ]
}
